; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l37_p37_c37_g37_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	loc36 - location
	loc37 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	crate36 - crate
	crate37 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
	person37 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(crate-at crate28 depot)
	(crate-at crate29 depot)
	(crate-at crate30 depot)
	(crate-at crate31 depot)
	(crate-at crate32 depot)
	(crate-at crate33 depot)
	(crate-at crate34 depot)
	(crate-at crate35 depot)
	(crate-at crate36 depot)
	(crate-at crate37 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(content-crate medicine crate28)
	(content-crate medicine crate29)
	(content-crate medicine crate30)
	(content-crate medicine crate31)
	(content-crate medicine crate32)
	(content-crate medicine crate33)
	(content-crate medicine crate34)
	(content-crate medicine crate35)
	(content-crate medicine crate36)
	(content-crate medicine crate37)
	(person-at person1 loc32)
	(person-at person2 loc36)
	(person-at person3 loc23)
	(person-at person4 loc35)
	(person-at person5 loc32)
	(person-at person6 loc22)
	(person-at person7 loc2)
	(person-at person8 loc6)
	(person-at person9 loc26)
	(person-at person10 loc28)
	(person-at person11 loc26)
	(person-at person12 loc13)
	(person-at person13 loc19)
	(person-at person14 loc25)
	(person-at person15 loc8)
	(person-at person16 loc35)
	(person-at person17 loc29)
	(person-at person18 loc36)
	(person-at person19 loc15)
	(person-at person20 loc10)
	(person-at person21 loc2)
	(person-at person22 loc29)
	(person-at person23 loc26)
	(person-at person24 loc2)
	(person-at person25 loc12)
	(person-at person26 loc7)
	(person-at person27 loc24)
	(person-at person28 loc27)
	(person-at person29 loc15)
	(person-at person30 loc37)
	(person-at person31 loc12)
	(person-at person32 loc32)
	(person-at person33 loc27)
	(person-at person34 loc22)
	(person-at person35 loc35)
	(person-at person36 loc17)
	(person-at person37 loc8)
	(person-need person1 food)
	(person-need person3 medicine)
	(person-need person4 medicine)
	(person-need person5 medicine)
	(person-need person6 medicine)
	(person-need person7 medicine)
	(person-need person8 medicine)
	(person-need person9 medicine)
	(person-need person10 medicine)
	(person-need person11 medicine)
	(person-need person12 medicine)
	(person-need person14 medicine)
	(person-need person15 food)
	(person-need person15 medicine)
	(person-need person16 medicine)
	(person-need person17 medicine)
	(person-need person18 medicine)
	(person-need person19 food)
	(person-need person19 medicine)
	(person-need person20 food)
	(person-need person20 medicine)
	(person-need person22 medicine)
	(person-need person24 medicine)
	(person-need person25 food)
	(person-need person26 food)
	(person-need person26 medicine)
	(person-need person27 medicine)
	(person-need person28 food)
	(person-need person29 medicine)
	(person-need person30 food)
	(person-need person30 medicine)
	(person-need person32 food)
	(person-need person32 medicine)
	(person-need person33 medicine)
	(person-need person35 food)
	(person-need person36 medicine)
	(person-need person37 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person8 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person14 medicine)
	(has-content-person person15 food)
	(has-content-person person15 medicine)
	(has-content-person person16 medicine)
	(has-content-person person17 medicine)
	(has-content-person person18 medicine)
	(has-content-person person19 food)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person20 medicine)
	(has-content-person person22 medicine)
	(has-content-person person24 medicine)
	(has-content-person person25 food)
	(has-content-person person26 food)
	(has-content-person person26 medicine)
	(has-content-person person27 medicine)
	(has-content-person person28 food)
	(has-content-person person29 medicine)
	(has-content-person person30 food)
	(has-content-person person30 medicine)
	(has-content-person person32 food)
	(has-content-person person32 medicine)
	(has-content-person person33 medicine)
	(has-content-person person35 food)
	(has-content-person person36 medicine)
	(has-content-person person37 medicine)
))
)

; plan
1. (pick-up-crate crate37 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate37 depot)
   added: (has-crate-drone-arm right crate37)
   goals met: 1 of 38
2. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 1 of 38
3. (drone-move depot loc36 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc36)
   goals met: 0 of 38
4. (drop-crate loc36 person18 crate37 right medicine drone1)
   deleted: (has-crate-drone-arm right crate37)
   added: (has-content-person person18 medicine) (empty-arm right)
   goals met: 1 of 38
5. (drone-move loc36 depot drone1)
   deleted: (drone-at drone1 loc36)
   added: (drone-at drone1 depot)
   goals met: 2 of 38
6. (pick-up-crate crate36 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate36 depot)
   added: (has-crate-drone-arm right crate36)
   goals met: 2 of 38
7. (drone-move depot loc28 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc28)
   goals met: 1 of 38
8. (drop-crate loc28 person10 crate36 right medicine drone1)
   deleted: (has-crate-drone-arm right crate36)
   added: (has-content-person person10 medicine) (empty-arm right)
   goals met: 2 of 38
9. (drone-move loc28 depot drone1)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 depot)
   goals met: 3 of 38
10. (pick-up-crate crate35 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate35 depot)
   added: (has-crate-drone-arm right crate35)
   goals met: 3 of 38
11. (drone-move depot loc25 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc25)
   goals met: 2 of 38
12. (drop-crate loc25 person14 crate35 right medicine drone1)
   deleted: (has-crate-drone-arm right crate35)
   added: (has-content-person person14 medicine) (empty-arm right)
   goals met: 3 of 38
13. (drone-move loc25 depot drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 depot)
   goals met: 4 of 38
14. (pick-up-crate crate34 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate34 depot)
   added: (has-crate-drone-arm right crate34)
   goals met: 4 of 38
15. (drone-move depot loc24 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc24)
   goals met: 3 of 38
16. (drop-crate loc24 person27 crate34 right medicine drone1)
   deleted: (has-crate-drone-arm right crate34)
   added: (has-content-person person27 medicine) (empty-arm right)
   goals met: 4 of 38
17. (drone-move loc24 depot drone1)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 depot)
   goals met: 5 of 38
18. (pick-up-crate crate33 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate33 depot)
   added: (has-crate-drone-arm right crate33)
   goals met: 5 of 38
19. (drone-move depot loc23 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc23)
   goals met: 4 of 38
20. (drop-crate loc23 person3 crate33 right medicine drone1)
   deleted: (has-crate-drone-arm right crate33)
   added: (has-content-person person3 medicine) (empty-arm right)
   goals met: 5 of 38
21. (drone-move loc23 depot drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 depot)
   goals met: 6 of 38
22. (pick-up-crate crate32 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate32 depot)
   added: (has-crate-drone-arm right crate32)
   goals met: 6 of 38
23. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 5 of 38
24. (drop-crate loc22 person6 crate32 right medicine drone1)
   deleted: (has-crate-drone-arm right crate32)
   added: (has-content-person person6 medicine) (empty-arm right)
   goals met: 6 of 38
25. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 7 of 38
26. (pick-up-crate crate31 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate31 depot)
   added: (has-crate-drone-arm right crate31)
   goals met: 7 of 38
27. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 6 of 38
28. (drop-crate loc17 person36 crate31 right medicine drone1)
   deleted: (has-crate-drone-arm right crate31)
   added: (has-content-person person36 medicine) (empty-arm right)
   goals met: 7 of 38
29. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 8 of 38
30. (pick-up-crate crate30 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate30 depot)
   added: (has-crate-drone-arm right crate30)
   goals met: 8 of 38
31. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 7 of 38
32. (drop-crate loc13 person12 crate30 right medicine drone1)
   deleted: (has-crate-drone-arm right crate30)
   added: (has-content-person person12 medicine) (empty-arm right)
   goals met: 8 of 38
33. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 9 of 38
34. (pick-up-crate crate29 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate29 depot)
   added: (has-crate-drone-arm right crate29)
   goals met: 9 of 38
35. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 8 of 38
36. (drop-crate loc12 person25 crate10 left food drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person25 food) (empty-arm left)
   goals met: 9 of 38
37. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 10 of 38
38. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate9 depot)
   added: (has-crate-drone-arm left crate9)
   goals met: 10 of 38
39. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 9 of 38
40. (drop-crate loc6 person8 crate29 right medicine drone1)
   deleted: (has-crate-drone-arm right crate29)
   added: (has-content-person person8 medicine) (empty-arm right)
   goals met: 10 of 38
41. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 11 of 38
42. (pick-up-crate crate28 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate28 depot)
   added: (has-crate-drone-arm right crate28)
   goals met: 11 of 38
43. (drone-move depot loc37 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc37)
   goals met: 10 of 38
44. (drop-crate loc37 person30 crate9 left food drone1)
   deleted: (has-crate-drone-arm left crate9)
   added: (has-content-person person30 food) (empty-arm left)
   goals met: 11 of 38
45. (drop-crate loc37 person30 crate28 right medicine drone1)
   deleted: (has-crate-drone-arm right crate28)
   added: (has-content-person person30 medicine) (empty-arm right)
   goals met: 12 of 38
46. (drone-move loc37 depot drone1)
   deleted: (drone-at drone1 loc37)
   added: (drone-at drone1 depot)
   goals met: 13 of 38
47. (pick-up-crate crate27 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate27 depot)
   added: (has-crate-drone-arm right crate27)
   goals met: 13 of 38
48. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 13 of 38
49. (drone-move depot loc35 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc35)
   goals met: 12 of 38
50. (drop-crate loc35 person4 crate27 right medicine drone1)
   deleted: (has-crate-drone-arm right crate27)
   added: (has-content-person person4 medicine) (empty-arm right)
   goals met: 13 of 38
51. (drone-move loc35 depot drone1)
   deleted: (drone-at drone1 loc35)
   added: (drone-at drone1 depot)
   goals met: 14 of 38
52. (pick-up-crate crate26 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate26 depot)
   added: (has-crate-drone-arm right crate26)
   goals met: 14 of 38
53. (drone-move depot loc35 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc35)
   goals met: 13 of 38
54. (drop-crate loc35 person16 crate26 right medicine drone1)
   deleted: (has-crate-drone-arm right crate26)
   added: (has-content-person person16 medicine) (empty-arm right)
   goals met: 14 of 38
55. (drop-crate loc35 person35 crate8 left food drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person35 food) (empty-arm left)
   goals met: 15 of 38
56. (drone-move loc35 depot drone1)
   deleted: (drone-at drone1 loc35)
   added: (drone-at drone1 depot)
   goals met: 16 of 38
57. (pick-up-crate crate25 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate25 depot)
   added: (has-crate-drone-arm right crate25)
   goals met: 16 of 38
58. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate7 depot)
   added: (has-crate-drone-arm left crate7)
   goals met: 16 of 38
59. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 15 of 38
60. (drop-crate loc32 person1 crate7 left food drone1)
   deleted: (has-crate-drone-arm left crate7)
   added: (has-content-person person1 food) (empty-arm left)
   goals met: 16 of 38
61. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 17 of 38
62. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 17 of 38
63. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 16 of 38
64. (drop-crate loc32 person5 crate25 right medicine drone1)
   deleted: (has-crate-drone-arm right crate25)
   added: (has-content-person person5 medicine) (empty-arm right)
   goals met: 17 of 38
65. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 18 of 38
66. (pick-up-crate crate24 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate24 depot)
   added: (has-crate-drone-arm right crate24)
   goals met: 18 of 38
67. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 17 of 38
68. (drop-crate loc32 person32 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person32 food) (empty-arm left)
   goals met: 18 of 38
69. (drop-crate loc32 person32 crate24 right medicine drone1)
   deleted: (has-crate-drone-arm right crate24)
   added: (has-content-person person32 medicine) (empty-arm right)
   goals met: 19 of 38
70. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 20 of 38
71. (pick-up-crate crate23 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate23 depot)
   added: (has-crate-drone-arm right crate23)
   goals met: 20 of 38
72. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate5 depot)
   added: (has-crate-drone-arm left crate5)
   goals met: 20 of 38
73. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 19 of 38
74. (drop-crate loc29 person17 crate23 right medicine drone1)
   deleted: (has-crate-drone-arm right crate23)
   added: (has-content-person person17 medicine) (empty-arm right)
   goals met: 20 of 38
75. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 21 of 38
76. (pick-up-crate crate22 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate22 depot)
   added: (has-crate-drone-arm right crate22)
   goals met: 21 of 38
77. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 20 of 38
78. (drop-crate loc29 person22 crate22 right medicine drone1)
   deleted: (has-crate-drone-arm right crate22)
   added: (has-content-person person22 medicine) (empty-arm right)
   goals met: 21 of 38
79. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 22 of 38
80. (pick-up-crate crate21 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate21 depot)
   added: (has-crate-drone-arm right crate21)
   goals met: 22 of 38
81. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 21 of 38
82. (drop-crate loc27 person28 crate5 left food drone1)
   deleted: (has-crate-drone-arm left crate5)
   added: (has-content-person person28 food) (empty-arm left)
   goals met: 22 of 38
83. (drop-crate loc27 person33 crate21 right medicine drone1)
   deleted: (has-crate-drone-arm right crate21)
   added: (has-content-person person33 medicine) (empty-arm right)
   goals met: 23 of 38
84. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 24 of 38
85. (pick-up-crate crate20 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate20 depot)
   added: (has-crate-drone-arm right crate20)
   goals met: 24 of 38
86. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 24 of 38
87. (drone-move depot loc26 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc26)
   goals met: 23 of 38
88. (drop-crate loc26 person9 crate20 right medicine drone1)
   deleted: (has-crate-drone-arm right crate20)
   added: (has-content-person person9 medicine) (empty-arm right)
   goals met: 24 of 38
89. (drone-move loc26 depot drone1)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 depot)
   goals met: 25 of 38
90. (pick-up-crate crate19 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate19 depot)
   added: (has-crate-drone-arm right crate19)
   goals met: 25 of 38
91. (drone-move depot loc26 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc26)
   goals met: 24 of 38
92. (drop-crate loc26 person11 crate19 right medicine drone1)
   deleted: (has-crate-drone-arm right crate19)
   added: (has-content-person person11 medicine) (empty-arm right)
   goals met: 25 of 38
93. (drone-move loc26 depot drone1)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 depot)
   goals met: 26 of 38
94. (pick-up-crate crate18 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate18 depot)
   added: (has-crate-drone-arm right crate18)
   goals met: 26 of 38
95. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 25 of 38
96. (drop-crate loc15 person19 crate4 left food drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person19 food) (empty-arm left)
   goals met: 26 of 38
97. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 27 of 38
98. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 27 of 38
99. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 26 of 38
100. (drop-crate loc15 person19 crate18 right medicine drone1)
   deleted: (has-crate-drone-arm right crate18)
   added: (has-content-person person19 medicine) (empty-arm right)
   goals met: 27 of 38
101. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 28 of 38
102. (pick-up-crate crate17 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate17 depot)
   added: (has-crate-drone-arm right crate17)
   goals met: 28 of 38
103. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 27 of 38
104. (drop-crate loc15 person29 crate17 right medicine drone1)
   deleted: (has-crate-drone-arm right crate17)
   added: (has-content-person person29 medicine) (empty-arm right)
   goals met: 28 of 38
105. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 29 of 38
106. (pick-up-crate crate16 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate16 depot)
   added: (has-crate-drone-arm right crate16)
   goals met: 29 of 38
107. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 28 of 38
108. (drop-crate loc10 person20 crate3 left food drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person20 food) (empty-arm left)
   goals met: 29 of 38
109. (drop-crate loc10 person20 crate16 right medicine drone1)
   deleted: (has-crate-drone-arm right crate16)
   added: (has-content-person person20 medicine) (empty-arm right)
   goals met: 30 of 38
110. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 31 of 38
111. (pick-up-crate crate15 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate15 depot)
   added: (has-crate-drone-arm right crate15)
   goals met: 31 of 38
112. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 31 of 38
113. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 30 of 38
114. (drop-crate loc8 person15 crate2 left food drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person15 food) (empty-arm left)
   goals met: 31 of 38
115. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 32 of 38
116. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 32 of 38
117. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 31 of 38
118. (drop-crate loc7 person26 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person26 food) (empty-arm left)
   goals met: 32 of 38
119. (drop-crate loc7 person26 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm right crate15)
   added: (has-content-person person26 medicine) (empty-arm right)
   goals met: 33 of 38
120. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 34 of 38
121. (pick-up-crate crate14 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate14 depot)
   added: (has-crate-drone-arm right crate14)
   goals met: 34 of 38
122. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate13 depot)
   added: (has-crate-drone-arm left crate13)
   goals met: 34 of 38
123. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 33 of 38
124. (drop-crate loc8 person15 crate13 left medicine drone1)
   deleted: (has-crate-drone-arm left crate13)
   added: (has-content-person person15 medicine) (empty-arm left)
   goals met: 34 of 38
125. (drop-crate loc8 person37 crate14 right medicine drone1)
   deleted: (has-crate-drone-arm right crate14)
   added: (has-content-person person37 medicine) (empty-arm right)
   goals met: 35 of 38
126. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 36 of 38
127. (pick-up-crate crate12 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate12 depot)
   added: (has-crate-drone-arm right crate12)
   goals met: 36 of 38
128. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate11 depot)
   added: (has-crate-drone-arm left crate11)
   goals met: 36 of 38
129. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 35 of 38
130. (drop-crate loc2 person7 crate11 left medicine drone1)
   deleted: (has-crate-drone-arm left crate11)
   added: (has-content-person person7 medicine) (empty-arm left)
   goals met: 36 of 38
131. (drop-crate loc2 person24 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm right crate12)
   added: (has-content-person person24 medicine) (empty-arm right)
   goals met: 37 of 38
132. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 38 of 38
